app/views/families/add_members.erb

SELECT "users".* FROM "users"
SELECT  1 AS one FROM "users" INNER JOIN "families_users" ON "users"."id" = "families_users"."user_id" WHERE "families_users"."family_id" = $1 AND "users"."id" = $2 LIMIT $3  [["family_id", 1], ["id", 1], ["LIMIT", 1]]
---
		<% @users.each do |user| %>
			<% unless @family.users.include? user  %>