app/views/families/show.html.erb

			<ul>
				<%@family.shopping_lists.each do |sl|%>
---
SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."family_id" = $1  [["family_id", 1]]