app/views/shopping_lists/index.html.erb

SELECT "items".* FROM "items" WHERE "items"."shopping_list_id" = $1  [["shopping_list_id", "1"]]
---

		<%@list.items.each do |item|%>