app/controllers/families_controller.rb

  def do_add_member
    user = User.find params[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]