app/controllers/families_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    user  = User.find session[:user_id]

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "families" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sotirovi"], ["created_at", "2019-03-27 16:41:23.785627"], ["updated_at", "2019-03-27 16:41:23.785627"]]
---
  def create
  	@family = Family.new family_params

    user = User.find session[:user_id]

    admin = Administrator.create(user_id: user.id)

    @family.administrator = admin

    @family.save

SELECT  "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @family = Family.find params[:id]

SELECT  "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "families" SET "name" = $1, "updated_at" = $2 WHERE "families"."id" = $3  [["name", "Sotirovi"], ["updated_at", "2019-03-28 08:02:30.168882"], ["id", 5]]
---
  def update
    family = Family.find params[:id]

    family.update_attributes family_params

SELECT  "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def do_edit_budget
    family = Family.find params[:family_id]

SELECT  "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "families_users" ON "users"."id" = "families_users"."user_id" WHERE "families_users"."family_id" = $1  [["family_id", 5]]
---
  def show
  	@family = Family.find params[:id]

    @members = @family.users

    @items = @family.items.where(bought:true)
    if has_one_week_passed(@family.budget_duedate)
      @family.current_budget_state = @family.weekly_budget
      @family.budget_duedate = find_last_day_of_week()
      @family.save
    end
    transactions = Transaction.having("family_id = " + @family.id.to_s).group(:category_name, :id)

SELECT "users".* FROM "users"
SELECT  "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def add_members
    @users = User.all
    @family = Family.find params[:family_id]

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def do_add_member
    user = User.find params[:user_id]

    family = Family.find params[:family_id]