app/controllers/shopping_lists_controller.rb

UPDATE "items" SET "shopping_list_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["shopping_list_id", 1], ["updated_at", "2019-04-09 13:21:00.161364"], ["id", 12]]
---
	def delete_item
		family = Family.find(params[:family_id])
		list = family.shopping_lists.find(params[:sl_id])
		item = list.items.find(params[:item_id])

		if(family && item && list)
			list.items -= [item]
			list.save

UPDATE "items" SET "shopping_list_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["shopping_list_id", 2], ["updated_at", "2019-04-09 08:53:19.363080"], ["id", 8]]
---
	def buy_item
		family = Family.find(params[:family_id])
		list = family.shopping_lists.find(params[:sl_id])
		item = list.items.find(params[:item_id])
		item_name = item.items_enum.name
		category_name =  item.items_enum.category_name
		params_price = params[:price].to_f
		params_quantity = params[:quantity].to_i

		existingItem = Item.find_by items_enum: item.items_enum, quantity_unit: item.quantity_unit, bought: true
		if params_quantity == 0
			params_quantity = item.quantity
		end

		if not existingItem
			if params_quantity < item.quantity
				newItemQuantity = item.quantity - params_quantity
				item.quantity = params_quantity

				newItem = Item.new(items_enum: item.items_enum, shopping_list: list, family: family, price: params[:price].to_i, quantity: newItemQuantity, quantity_unit: item.quantity_unit)
				newItem.save
			end

			item.bought = true
			item.save