app/controllers/shopping_lists_controller.rb

	def index
		@family = Family.find(params[:family_id])
		puts()
		@list = Family.find(params[:family_id]).shopping_lists.find(params[:id])
---
SELECT  "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."family_id" = $1 AND "shopping_lists"."id" = $2 LIMIT $3  [["family_id", 1], ["id", 2], ["LIMIT", 1]]

	def create
		family = Family.find(params[:family_id])

		family.shopping_lists << ShoppingList.new(sl_params)
---
SELECT  "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "shopping_lists" ("name", "family_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "esteban"], ["family_id", "1"], ["created_at", "2019-04-03 12:54:13.771571"], ["updated_at", "2019-04-03 12:54:13.771571"]]

	def edit
		@family = Family.find(params[:family_id])

		@list = @family.shopping_lists.find(params[:id])

		@items_enum = ItemsEnum.all
---
SELECT  "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."family_id" = $1  [["family_id", "1"]]
SELECT "items_enums".* FROM "items_enums"

	def add_item
		@family = Family.find(params[:family_id])

		puts "List id: " + String(params[:family_id])

		@list = Family.find(params[:family_id]).shopping_lists.find(params[:sl_id])

		item = ItemsEnum.find(params[:item_id])

		if @list.items.include? Item.all.where(name: item.name, price: item.price)
			redirect_to "/families/" + String(@family.id) + "/shopping_lists/" + String(@list.id)
			return
		end

		@list.items << Item.find_or_create_by(name:item.name, price: item.price)
---
SELECT  "families".* FROM "families" WHERE "families"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."family_id" = $1  [["family_id", 1]]
SELECT  "items_enums".* FROM "items_enums" WHERE "items_enums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."name" = $1 AND "items"."price" = $2 LIMIT $3  [["name", "Chees"], ["price", "3.14"], ["LIMIT", 1]]
INSERT INTO "items" ("name", "price", "shopping_list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Pistol"], ["price", "100.0"], ["shopping_list_id", 2], ["created_at", "2019-04-09 08:54:42.594205"], ["updated_at", "2019-04-09 08:54:42.594205"]]