app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "something"], ["password", "lagalaga"], ["created_at", "2019-03-18 21:31:05.798204"], ["updated_at", "2019-03-18 21:31:05.798204"]]